Tekla Open API Reference for Tekla Structures 2025
ModelObject Methods
The ModelObject type exposes the following members.
Methods
Name | Description
CompareTo
 Compares Identifiers of model objects.
Delete
 Deletes the instance from the model database.
Equals
 Check if Identifiers of model objects are same.
GetAllReportProperties
 Retrieves all properties for the model object in one hashtable. Type for the returned value must be checked using type casting.
GetAllUserProperties
 Retrieves all properties for the model object in one hashtable. Type for the returned value must be checked using type casting.
GetChildren
 Returns an enumerator of all the children model objects.
GetCoordinateSystem
 Returns the coordinate system for the given model object.
GetCustomObjectType
 Gets custom object type name from an existing object.
GetDoubleReportProperties
 Retrieves multiple double report properties for the model object. It is faster to fetch multiple properties at once.
GetDoubleUserProperties
 Retrieves all double properties for the model object.
GetDynamicStringProperty
 Gets a dynamic string property from the model object.
GetFatherComponent
 Returns the father component of the model object.
GetHierarchicObjects
 Returns an enumerator of all the connected hierarchic objects.
GetIntegerReportProperties
 Retrieves multiple integer report properties for the model object. It is faster to fetch multiple properties at once.
GetIntegerUserProperties
 Retrieves all integer properties for the model object.
GetPhase
 Retrieves the phase of the model object (the phase number, the phase name, the phase comment and whether the phase is the current one or not).
GetReportProperty(String, Double)
 Retrieves a double property of the report for the model object.
GetReportProperty(String, Int32)
 Retrieves an integer property of the report for the model object.
GetReportProperty(String, String)
 Retrieves a string property of the report for the model object.
GetStringReportProperties
 Retrieves multiple string report properties for the model object. It is faster to fetch multiple properties at once.
GetStringUserProperties
 Retrieves all string properties for the model object.
GetUserProperty(String, Double)
 Retrieves a double property for the model object.
GetUserProperty(String, Int32)
 Retrieves an integer property for the model object.
GetUserProperty(String, String)
 Retrieves a string property for the model object.
Insert
 Inserts the model object instance into the model database.
Modify
 Modifies the model instance in the model database.
Select
 Selects the model object instance from the model database.
SetCustomObjectType
 Sets a custom object type name for an existing object.
SetDynamicStringProperty
 Sets a dynamic string property for the model object.
SetLabel
 Sets a label for an object when a new instance is created, this method must be called before Insert. The label is used in plug-ins for identifying the changed object in modification.
SetPhase
 Sets the phase of the model object.
SetUserProperties
 Sets multiple properties for the model object.
SetUserProperty(String, Double)
 Sets a double property for the model object.
SetUserProperty(String, Int32)
 Sets an integer property for the model object.
SetUserProperty(String, String)
 Sets a string property for the model object.
Top
See Also
Reference
ModelObject Class
Tekla.Structures.Model Namespace